Ran Plan for dir: `newrelic` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # newrelic_alert_policy_channel.bitcoin-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "bitcoin-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4706532,
          + 4704703,
        ]
      ~ id          = "1205036:4704703:4706532" -> (known after apply)
        policy_id   = 1205036
    }

  # newrelic_alert_policy_channel.media-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "media-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4706532,
          + 4704703,
        ]
      ~ id          = "1205041:4704703:4706532" -> (known after apply)
        policy_id   = 1205041
    }

  # newrelic_alert_policy_channel.server-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "server-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4706532,
          + 4704703,
        ]
      ~ id          = "1205037:4704703:4706532" -> (known after apply)
        policy_id   = 1205037
    }

  # newrelic_alert_policy_channel.web-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "web-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4706532,
          + 4704703,
        ]
      ~ id          = "1205032:4704703:4706532" -> (known after apply)
        policy_id   = 1205032
    }

  # newrelic_nrql_alert_condition.bitcoin-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "bitcoin-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205036:17874690" -> null
      - name                           = "Bitcoin is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205036 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.btc-rpc-explorer-cache-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "btc-rpc-explorer-cache-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205036:17878707" -> null
      - name                           = "BTC-RPC-Explorer-Cache is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205036 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.btc-rpc-explorer-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "btc-rpc-explorer-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205036:17878706" -> null
      - name                           = "BTC-RPC-Explorer is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205036 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.deluge-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "deluge-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874719" -> null
      - name                           = "Deluge is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.electrumx-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "electrumx-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205036:17874691" -> null
      - name                           = "Electrumx is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205036 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.foreman-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "foreman-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17878738" -> null
      - name                           = "Foreman not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM Log
                      SELECT uniqueCount(running_vms)
                      WHERE (running_vms LIKE '%foreman%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.high-cpu-usage will be destroyed
- resource "newrelic_nrql_alert_condition" "high-cpu-usage" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 120 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17874694" -> null
      - name                           = "CPU pegged above 90" -> null
      - open_violation_on_expiration   = false -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "above" -> null
          - threshold             = 90 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM SystemSample
                      SELECT average(cpuPercent)
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.high-disk-usage will be destroyed
- resource "newrelic_nrql_alert_condition" "high-disk-usage" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 120 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17874696" -> null
      - name                           = "Disk usage is high" -> null
      - open_violation_on_expiration   = false -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "above" -> null
          - threshold             = 90 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM SystemSample
                      SELECT average(diskUsedPercent)
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.high-memory-usage will be destroyed
- resource "newrelic_nrql_alert_condition" "high-memory-usage" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 120 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17874695" -> null
      - name                           = "Memory usage is high" -> null
      - open_violation_on_expiration   = false -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "above" -> null
          - threshold             = 90 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM SystemSample
                      SELECT average(memoryUsedPercent)
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.keymaster-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "keymaster-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17878739" -> null
      - name                           = "Keymaster not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM Log
                      SELECT uniqueCount(running_vms)
                      WHERE (running_vms LIKE '%keymaster%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.motion-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "motion-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874714" -> null
      - name                           = "Motion is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.motioneye-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "motioneye-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874718" -> null
      - name                           = "MotionEye is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.nextcloud-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "nextcloud-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874716" -> null
      - name                           = "NextCloud is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.nextcloudcache-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "nextcloudcache-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 120 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874721" -> null
      - name                           = "NextCloudCache is not running" -> null
      - open_violation_on_expiration   = false -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 3600 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'NextCloudCache'
                      FACET host 
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.nextclouddb-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "nextclouddb-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874717" -> null
      - name                           = "NextCloudDB is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.nginx-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "nginx-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874720" -> null
      - name                           = "NGINX is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.pizero-ssh will be destroyed
- resource "newrelic_nrql_alert_condition" "pizero-ssh" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 900 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205037:17885624" -> null
      - name                           = "Pizero SSH not open" -> null
      - open_violation_on_expiration   = false -> null
      - policy_id                      = 1205037 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM Log
                      SELECT count(*)
                      WHERE job_comment = 'Check that pizero SSH is open'
                        AND port_open = 'true'
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.plex-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "plex-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874713" -> null
      - name                           = "Plex is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_nrql_alert_condition.sickchill-not-running will be destroyed
- resource "newrelic_nrql_alert_condition" "sickchill-not-running" {
      - account_id                     = 3020622 -> null
      - aggregation_window             = 60 -> null
      - close_violations_on_expiration = false -> null
      - enabled                        = true -> null
      - expiration_duration            = 300 -> null
      - fill_option                    = "none" -> null
      - fill_value                     = 0 -> null
      - id                             = "1205041:17874715" -> null
      - name                           = "SickChill is not running" -> null
      - open_violation_on_expiration   = true -> null
      - policy_id                      = 1205041 -> null
      - type                           = "static" -> null
      - value_function                 = "SINGLE_VALUE" -> null
      - violation_time_limit_seconds   = 604800 -> null

      - critical {
          - duration              = 0 -> null
          - operator              = "equals" -> null
          - threshold             = 0 -> null
          - threshold_duration    = 300 -> null
          - threshold_occurrences = "all" -> null
        }

      - nrql {
          - evaluation_offset = 3 -> null
          - query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%container-name%')
                        OR (containerName LIKE '%container-name%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT -> null
        }
    }

  # newrelic_synthetics_alert_condition.bc will be destroyed
- resource "newrelic_synthetics_alert_condition" "bc" {
      - enabled    = true -> null
      - id         = "1205032:17874614" -> null
      - monitor_id = "daec4498-bf5b-46d5-aad5-cd35f0bc243c" -> null
      - name       = "Plex Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_alert_condition.cloud will be destroyed
- resource "newrelic_synthetics_alert_condition" "cloud" {
      - enabled    = true -> null
      - id         = "1205032:17874609" -> null
      - monitor_id = "ba2a2c43-f70c-476f-bf0b-21e8d61ac938" -> null
      - name       = "NextCloud Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_alert_condition.plex will be destroyed
- resource "newrelic_synthetics_alert_condition" "plex" {
      - enabled    = true -> null
      - id         = "1205032:17874613" -> null
      - monitor_id = "c6ee686d-48dd-48d5-ad19-418da74007f4" -> null
      - name       = "Plex Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_alert_condition.qtosw will be destroyed
- resource "newrelic_synthetics_alert_condition" "qtosw" {
      - enabled    = true -> null
      - id         = "1205032:17874611" -> null
      - monitor_id = "61967c8d-fd6a-4d45-bd22-45a7910d5071" -> null
      - name       = "QTOSW Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_alert_condition.rancher will be destroyed
- resource "newrelic_synthetics_alert_condition" "rancher" {
      - enabled    = true -> null
      - id         = "1205032:17874610" -> null
      - monitor_id = "8b4f71f2-20a5-48a9-9ea4-1f147ebf435f" -> null
      - name       = "Rancher Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_alert_condition.torrent will be destroyed
- resource "newrelic_synthetics_alert_condition" "torrent" {
      - enabled    = true -> null
      - id         = "1205032:17874612" -> null
      - monitor_id = "cf9a6f62-d7d0-47e7-a877-bdfb0b7fa0a1" -> null
      - name       = "Torrent Web Alert Policy" -> null
      - policy_id  = 1205032 -> null
    }

  # newrelic_synthetics_monitor.bc will be destroyed
- resource "newrelic_synthetics_monitor" "bc" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "daec4498-bf5b-46d5-aad5-cd35f0bc243c" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "BC" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://bc.qtosw.com" -> null
      - validation_string         = "server is up" -> null
      - verify_ssl                = true -> null
    }

  # newrelic_synthetics_monitor.cloud will be destroyed
- resource "newrelic_synthetics_monitor" "cloud" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "ba2a2c43-f70c-476f-bf0b-21e8d61ac938" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "NextCloud" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://cloud.qtosw.com" -> null
      - validation_string         = "Nextcloud" -> null
      - verify_ssl                = false -> null
    }

  # newrelic_synthetics_monitor.plex will be destroyed
- resource "newrelic_synthetics_monitor" "plex" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "c6ee686d-48dd-48d5-ad19-418da74007f4" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "Plex" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://plex.qtosw.com/web/index.html" -> null
      - validation_string         = "plex" -> null
      - verify_ssl                = false -> null
    }

  # newrelic_synthetics_monitor.qtosw will be destroyed
- resource "newrelic_synthetics_monitor" "qtosw" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "61967c8d-fd6a-4d45-bd22-45a7910d5071" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "QTOSW" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://qtosw.com" -> null
      - validation_string         = "Witty" -> null
      - verify_ssl                = true -> null
    }

  # newrelic_synthetics_monitor.rancher will be destroyed
- resource "newrelic_synthetics_monitor" "rancher" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "8b4f71f2-20a5-48a9-9ea4-1f147ebf435f" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "Rancher" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://rancher.qtosw.com" -> null
      - validation_string         = "Loading" -> null
      - verify_ssl                = false -> null
    }

  # newrelic_synthetics_monitor.torrent will be destroyed
- resource "newrelic_synthetics_monitor" "torrent" {
      - bypass_head_request       = false -> null
      - frequency                 = 10 -> null
      - id                        = "cf9a6f62-d7d0-47e7-a877-bdfb0b7fa0a1" -> null
      - locations                 = [
          - "AWS_US_EAST_1",
        ] -> null
      - name                      = "Torrent" -> null
      - sla_threshold             = 7 -> null
      - status                    = "ENABLED" -> null
      - treat_redirect_as_failure = false -> null
      - type                      = "SIMPLE" -> null
      - uri                       = "https://torrent.qtosw.com" -> null
      - validation_string         = "WebUI" -> null
      - verify_ssl                = true -> null
    }

  # module.bitcoin-containers-not-running["bitcoin"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "Bitcoin is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%bitcoin%')
                        OR (containerName LIKE '%bitcoin%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.bitcoin-containers-not-running["btc-rpc-explorer"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "BTC-RPC-Explorer is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%btc-rpc-explorer%')
                        OR (containerName LIKE '%btc-rpc-explorer%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.bitcoin-containers-not-running["btc-rpc-explorer-cache"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "Electrumx is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%btc-rpc-explorer-cache%')
                        OR (containerName LIKE '%btc-rpc-explorer-cache%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.bitcoin-containers-not-running["electrumx"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "Electrumx is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%electrumx%')
                        OR (containerName LIKE '%electrumx%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.general-web-checks["bc"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "BC Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["bc"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "BC"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://bc.qtosw.com"
      + validation_string = "server is up"
      + verify_ssl        = true
    }

  # module.general-web-checks["cloud"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "NextCloud Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["cloud"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "NextCloud"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://cloud.qtosw.com"
      + validation_string = "Nextcloud"
      + verify_ssl        = true
    }

  # module.general-web-checks["plex"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Plex Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["plex"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Plex"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://plex.qtosw.com/web/index.html"
      + validation_string = "plex"
      + verify_ssl        = true
    }

  # module.general-web-checks["qtosw"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "QTOSW Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["qtosw"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "QTOSW"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://qtosw.com"
      + validation_string = "Witty"
      + verify_ssl        = true
    }

  # module.general-web-checks["rancher"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Rancher Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["rancher"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Rancher"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://rancher.qtosw.com"
      + validation_string = "Loading"
      + verify_ssl        = true
    }

  # module.general-web-checks["torrent"].newrelic_synthetics_alert_condition.ssl will be created
+ resource "newrelic_synthetics_alert_condition" "ssl" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Torrent Web Alert Policy"
      + policy_id  = 1205037
    }

  # module.general-web-checks["torrent"].newrelic_synthetics_monitor.ssl will be created
+ resource "newrelic_synthetics_monitor" "ssl" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Torrent"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://torrent.qtosw.com"
      + validation_string = "WebUI"
      + verify_ssl        = true
    }

  # module.media-containers-not-running["Deluge"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "Deluge is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%Deluge%')
                        OR (containerName LIKE '%Deluge%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["NextCloud"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "NextCloud is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%NextCloud%')
                        OR (containerName LIKE '%NextCloud%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["NextCloudDB"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "NextCloudDB is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%NextCloudDB%')
                        OR (containerName LIKE '%NextCloudDB%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["Nginx"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "NGINX is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%Nginx%')
                        OR (containerName LIKE '%Nginx%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["SickChill"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "SickChill is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%SickChill%')
                        OR (containerName LIKE '%SickChill%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["motion"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "Motion is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%motion%')
                        OR (containerName LIKE '%motion%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["motioneye"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "MotionEye is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%motioneye%')
                        OR (containerName LIKE '%motioneye%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["nextcloudcache"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "NextCloudCache is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%nextcloudcache%')
                        OR (containerName LIKE '%nextcloudcache%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.media-containers-not-running["plex"].newrelic_nrql_alert_condition.container-running will be created
+ resource "newrelic_nrql_alert_condition" "container-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 900
      + id                             = (known after apply)
      + name                           = "PleX is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = 1205037
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 604800

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(status)
                      WHERE (entityName LIKE '%plex%')
                        OR (containerName LIKE '%plex%')
                        AND (status LIKE '%Up%' OR status LIKE '%Running%')
                      FACET hostname
            EOT
        }
    }

  # module.server-port-checks["pizero"].newrelic_nrql_alert_condition.c
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.